# YOLOv8n-EMA: 集成EMA注意力机制的优化模型
# 基于2024-2025前沿研究优化
# 在原YOLOv8n基础上添加EMA注意力和P2小目标检测层

nc: 7  # 电缆缺陷类别数
scales:
  n: [0.33, 0.25, 1024]  # YOLOv8n

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f, [256, True]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 6, C2f, [512, True]]      # 6
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 3, C2f, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9
  - [-1, 1, EMA, [1024]]           # 10 - EMA注意力

# Head with P2 small object detection
head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # 11
  - [[-1, 6], 1, Concat, [1]]                  # 12 cat P4
  - [-1, 3, C2f, [512]]                        # 13
  - [-1, 1, EMA, [512]]                        # 14 - EMA注意力

  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # 15
  - [[-1, 4], 1, Concat, [1]]                  # 16 cat P3
  - [-1, 3, C2f, [256]]                        # 17
  - [-1, 1, EMA, [256]]                        # 18 - EMA注意力

  # P2小目标检测层 (新增)
  - [-1, 1, nn.Upsample, [None, 2, nearest]]  # 19
  - [[-1, 2], 1, Concat, [1]]                  # 20 cat P2
  - [-1, 3, C2f, [128]]                        # 21 P2检测特征
  - [-1, 1, EMA, [128]]                        # 22 - EMA注意力

  - [-1, 1, Conv, [128, 3, 2]]                 # 23
  - [[-1, 18], 1, Concat, [1]]                 # 24 cat P3
  - [-1, 3, C2f, [256]]                        # 25

  - [-1, 1, Conv, [256, 3, 2]]                 # 26
  - [[-1, 14], 1, Concat, [1]]                 # 27 cat P4
  - [-1, 3, C2f, [512]]                        # 28

  - [-1, 1, Conv, [512, 3, 2]]                 # 29
  - [[-1, 10], 1, Concat, [1]]                 # 30 cat P5
  - [-1, 3, C2f, [1024]]                       # 31

  - [[22, 25, 28, 31], 1, Detect, [nc]]        # 32 Detect(P2, P3, P4, P5)
