# YOLOv8n with CBAM Attention Module
# 电缆缺陷检测增强版 - 提升小目标检测能力

# Parameters
nc: 7  # ACSR缺陷类别数量
scales:
  n: [0.33, 0.25, 1024]

# YOLOv8n backbone with CBAM
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, CBAM, []]              # 5-CBAM after P3 (auto channels)
  - [-1, 1, Conv, [512, 3, 2]]     # 6-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, CBAM, []]              # 8-CBAM after P4 (auto channels)
  - [-1, 1, Conv, [1024, 3, 2]]    # 9-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, CBAM, []]              # 11-CBAM after P5 (auto channels)
  - [-1, 1, SPPF, [1024, 5]]       # 12

# YOLOv8n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]      # cat backbone P4
  - [-1, 3, C2f, [512]]            # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]      # cat backbone P3
  - [-1, 3, C2f, [256]]            # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]     # cat head P4
  - [-1, 3, C2f, [512]]            # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]     # cat head P5
  - [-1, 3, C2f, [1024]]           # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]]  # Detect(P3, P4, P5)
